onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВИК_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.ВИК_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВИК_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//++ Кожевников ВЕ ДЗ 01.07.2024   
	ВИК_СозданиеДополнительныхЭлементовФормы();
    //-- Кожевников ВЕ ДЗ 01.07.2024  
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//-- Кожевников ВЕ ДЗ 01.07.2024
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	КоэфСкидки = (100 - Объект.ВИК_СогласованнаяСкидка) / 100;
	ОбщаяСкидка = (КоэффициентСкидки + КоэфСкидки) - 1;
	
	Если ОбщаяСкидка < 0 Тогда 	 
		Сообщить("Общая скидка не должна привышать 100% !"); 
		ТекущиеДанные.Сумма = 0;
	Иначе   	 
		ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * ОбщаяСкидка; 		 
	КонецЕсли; 
	
	РассчитатьСуммуДокумента();     
	//-- Кожевников ВЕ ДЗ 01.07.2024 
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти

#Область ВнесениеИзмененийКонфигурации    

&НаСервере
Процедура ВИК_СозданиеДополнительныхЭлементовФормы()  
	//++ Кожевников ВЕ ДЗ1 24.04.2024 
	ЭлементКонтактноеЛицо = Элементы.Добавить("ВИК_КонтактноеЛицо", Тип("ПолеФормы"),ЭтаФорма.Элементы.ГруппаШапкаПраво);
	ЭлементКонтактноеЛицо.ПутьКДанным = "Объект.ВИК_КонтактноеЛицо";
	ЭлементКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементКонтактноеЛицо.Заголовок = "Контактное лицо";
	
	ЭлементСогласованнаяСкидка = Элементы.Добавить("ВИК_СогласованнаяСкидка", Тип("ПолеФормы"),ЭтаФорма.Элементы.ГруппаШапкаЛево);
	ЭлементСогласованнаяСкидка.ПутьКДанным = "Объект.ВИК_СогласованнаяСкидка";
	ЭлементСогласованнаяСкидка.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСогласованнаяСкидка.Заголовок = "Согласованная скидка";
	ЭлементСогласованнаяСкидка.УстановитьДействие("ПриИзменении","ВИК_СогласованнаяСкидкаПриИзменении");  
	
	Команда = Команды.Добавить("ПересчитатьТаблицу");
	Команда.Заголовок = "Пересчитать таблицу"; 
	Команда.Действие = "ВИК_ПересчитатьТаблицу";
	
	КнопкаКоманды = Элементы.Добавить("КнопкаПересчитатьТаблицу", Тип("КнопкаФормы"),ЭтаФорма.Элементы.ГруппаШапкаЛево);
	КнопкаКоманды.ИмяКоманды = "ПересчитатьТаблицу";
	КнопкаКоманды.Вид = ВидКнопкиФормы.ОбычнаяКнопка;    
	//-- Кожевников ВЕ ДЗ1 24.04.2024    
КонецПроцедуры


&НаКлиенте
Асинх Процедура ВИК_СогласованнаяСкидкаПриИзменении(Элемент)  
	 //++ Кожевников ВЕ ДЗ1 24.04.2024 
	 ТекстВопроса = "Изменен процент скидки.Пересчитать таблицы товаров и услуг?";
	 
	 Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);   
	 
	 Если Ответ = КодВозвратаДиалога.Да Тогда  	  
		  	  
		 ВИК_РассчитатьСуммуСоСкидкой(); 	  
	 КонецЕсли;	 
	 //-- Кожевников ВЕ ДЗ1 24.04.2024 
 КонецПроцедуры   
 
 &НаКлиенте
 Процедура ВИК_РассчитатьСуммуСоСкидкой() 
	 //++ Кожевников ВЕ ДЗ3 08.05.2024 
	 КоэфСкидки = (100 - Объект.ВИК_СогласованнаяСкидка) / 100;  
	 
	 Для Каждого СтрокаТЧТовары Из Объект.Товары Цикл 		 
		 КоэффициентСкидки = 1 - СтрокаТЧТовары.Скидка / 100; 
		 ОбщаяСкидка = (КоэффициентСкидки + КоэфСкидки) - 1; 
		 
		 Если ОбщаяСкидка < 0 Тогда 	 
			 Сообщить("Общая скидка не должна привышать 100% !");  
			 СтрокаТЧТовары.Сумма = 0;
		 Иначе
			 СтрокаТЧТовары.Сумма = СтрокаТЧТовары.Цена * СтрокаТЧТовары.Количество * ОбщаяСкидка ;	
		 КонецЕсли; 
	 КонецЦикла;
	 
	 Для Каждого СтрокаТЧУслуги Из Объект.Услуги Цикл 
		 КоэффициентСкидки = 1 - СтрокаТЧУслуги.Скидка / 100; 
		 ОбщаяСкидка = (КоэффициентСкидки + КоэфСкидки) - 1; 
		 
		 Если ОбщаяСкидка < 0 Тогда 	 
			 Сообщить("Общая скидка не должна привышать 100% !");
			 СтрокаТЧУслуги.Сумма = 0;
		 Иначе 		 
			 СтрокаТЧУслуги.Сумма = СтрокаТЧУслуги.Цена * СтрокаТЧУслуги.Количество * ОбщаяСкидка ; 
		 КонецЕсли; 
	 КонецЦикла; 	   
	 //-- Кожевников ВЕ ДЗ3 08.05.2024 
 КонецПроцедуры   
 
  &НаКлиенте
 Процедура ВИК_ПересчитатьТаблицу(Команда)
	 //++ Кожевников ВЕ ДЗ1 24.04.2024  
	 ВИК_РассчитатьСуммуСоСкидкой();
	 //-- Кожевников ВЕ ДЗ1 24.04.2024 
 КонецПроцедуры

 #КонецОбласти
